/* 
手机 ipad kindle
app
native app
安卓 ios
安卓开发工程师  ios开发工程师   两个不同的语言去写的  缺点：开发成本高、安卓和ios在版本上的上线时间可能不一致（商城需要审核） 下载安装包
运行流畅（基于手机系统去运行）还能操作手机的软硬件

webapp ：在手机浏览器运行
html5页面和js开发的
开发一套代码就可以
好维护  版本更新简单（在自己服务器更改）上线不需要审核
缺点：运行没有app流畅  不太容易操作手机上的软硬件
不需要下载安装包


hybrid 混合开发
把app的特点和web的特点结合到一起，主要安卓工程师开发一个安卓app的架子，这个架子可以在手机系统上运行，可以操作手机的软硬件
app的样式、结构、和逻辑由前端开发工程师来写（h5页面）
在app架子里有一个叫web view，在它里面可以运行h5代码，(就是沟通app和h5的媒介,内嵌的浏览器，如果需要打开摄像头，告诉web view ，webview去通知app)

vue react  
uniapp（自动生成小程序、安卓、ios。。。与vue语法相似）  reactnative（与react语法相似）有小bug 一套生成多套会有些缺陷 完美的就是由安卓或者ios工程师去写
*/